БИТУправление_медицинским_центром_демо/src/Documents/invЗаявкаНаИсследование/invЗаявкаНаИсследование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>invЗаявкаНаИсследование</name>
  <attributes>
    <name>Пациент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Бланк</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Лаборатории</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукты</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.invПродукт</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПродукта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПродукта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контейнеры</name>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.invКонтейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Биоматериал</name>
      <type>
        <types>CatalogRef.invБиоматериал</types>
      </type>
    </attributes>
    <attributes>
      <name>ИЛН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокИНЗ</name>
    <attributes>
      <name>ИНЗ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/invНастройкиПодразделения/invНастройкиПодразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>invНастройкиПодразделения</name>
  <resources>
    <name>Токен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПортПринтера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбщаяПапкаВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПапкаЗагрузкиXML</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПутьКРезультатамПДФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФТПВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛогинВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПарольВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПапкаВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>AddressCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Лаборант</name>
    <comment>На него будут создаваться приемы в базе</comment>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Documents/invЗаявкаНаИсследование/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура РаспечататьБланк(Команда)
	ИНЗ = РаспечататьБланкНаСервере();
	БланкДД = ПолучитьИзВременногоХранилища(АдресБланка);
	ПутьЗаписи = КаталогВременныхФайлов() + ИНЗ + ".pdf";
    БланкДД.Записать(ПутьЗаписи);
    ЗапуститьПриложение(ПутьЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьШтрихКод(Команда)
	Если Элементы.Контейнеры.ТекущиеДанные <> Неопределено Тогда
		ШК = ПолучитьШКНаСервере(Элементы.Контейнеры.ТекущиеДанные.ИЛН);
		ПортПринтера = ПолучитьПортПринтераНаСервере();
		Если ЗначениеЗаполнено(ШК) Тогда
			Запись = Новый ЗаписьДанных(ПортПринтера);
			Запись.Записать(ШК);
			Запись.Закрыть();
			//ВременныйФайл = КаталогВременныхФайлов() + Элементы.Контейнеры.ТекущиеДанные.ИЛН + ".txt";
			//ШК.Записать(ВременныйФайл);
			//ТекстДок = Новый ТекстовыйДокумент;
			//ТекстДок.Прочитать(ВременныйФайл);
			//ТекстДок.Записать(ПортПринтера,"utf-8");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьШКЗаявки(Команда)
	//Для каждого Контейнер Из Объект.Контейнеры Цикл 
	//	//Если Элементы.Контейнеры.ТекущиеДанные <> Неопределено Тогда
	//		ТекстДок = Новый ТекстовыйДокумент;
	//		ТекстДок.УстановитьТекст(Контейнер.ШтрихКод);
	//		ТекстДок.Записать("\\ws-00464\zebra","cp866");
	//	//КонецЕсли;
	//КонецЦикла;
	ШК = РаспечататьВсеШКНаСервере();
	ПортПринтера = ПолучитьПортПринтераНаСервере();
	Для Каждого стрШК Из ШК Цикл
		Если стрШК <> Неопределено Тогда
			Запись = Новый ЗаписьДанных(ПортПринтера);			
			Запись.Записать(стрШК);			
			Запись.Закрыть();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция РаспечататьБланкНаСервере()
	Документ = ДанныеФормыВЗначение(Объект,тип("ДокументОбъект.invЗаявкаНаИсследование"));
	АдресБланка = ПоместитьВоВременноеХранилище(Документ.Бланк.Получить());
	//ТД = Новый ТабличныйДокумент;
	//БланкДД = ПолучитьИзВременногоХранилища(АдресБланка);
	//ПутьЗаписи = КаталогВременныхФайлов() + Документ.ИНЗ + ".pdf";
    //БланкДД.Записать(ПутьЗаписи);
	Возврат Документ.Номер
КонецФункции

&НаСервере
Функция РаспечататьВсеШКНаСервере()
	Док = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.invЗаявкаНаИсследование"));
	МассивШК = Новый Массив;
	Для каждого Контейнер Из Док.Контейнеры Цикл
		МассивШК.Добавить(Контейнер.ШтрихКод.Получить());
	КонецЦикла;
	Возврат МассивШК
КонецФункции

&НаСервере
Функция ПолучитьШКНаСервере(ИЛН)
	ШК = "";
	Док = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.invЗаявкаНаИсследование"));
	стрКонтейнеры = Док.Контейнеры.Найти(ИЛН,"ИЛН");
	Если стрКонтейнеры <> Неопределено Тогда
		ШК = стрКонтейнеры.ШтрихКод.Получить();
	КонецЕсли;
	Возврат ШК
КонецФункции

&НаСервере
Функция ПолучитьПортПринтераНаСервере()
 Возврат РегистрыСведений.invНастройкиПодразделения.Получить(Новый Структура("Подразделение",Объект.Подразделение)).ПортПринтера;
КонецФункции

#КонецОбласти
